app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "New description (I've edited the description)"], ["updated_at", "2020-11-26 15:20:10.505566"], ["id", 3]]
---
	def update
	  @post = Post.find(params[:id])
	  #@post.update(title: params[:title], description: params[:description]) => you can do this with form_tag
	  @post.update(params.require(:post).permit(:title, :description)) # strong paramaters / form_for